starter-kit-elpa.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Starter Kit Package Manager</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="stylesheets/styles.css">
                <link rel="stylesheet" href="stylesheets/org-pygments.css">
</head>
<body>
<div id="content">
<h1 class="title">Starter Kit Package Manager</h1>
<p>
This is part of the <a href="starter-kit.html">Emacs Starter Kit</a>.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Starter Kit Package Manager</h2>
<div class="outline-text-2" id="text-1">
<p>
Since emacs version 24, elisp code can be downloaded, installed and loaded
almost automatically with <code>package.el</code>. There are still some discussions on how
to use it properly (see <a href="http://batsov.com/articles/2012/02/19/package-management-in-emacs-the-good-the-bad-and-the-ugly/">B. Batsov article</a> for example). In this file, we use
the "usual" way through ELPA for most of the packages to be
installed. Nevertheless, we also define some <code>el-get</code> command to install some
packages a bit oldy and not supported by any ELPA repository.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Checking internet connection</h3>
<div class="outline-text-3" id="text-1-1">
<p>
If there is no internet connection then no way to use any of the package
managers.  This should not work under Windows system since it does not have the
<code>network-interface-list</code> function
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">starter-kit-elpa-online</span> ()
  <span class="org-doc">"Check internet connectivity."</span>
  (<span class="org-keyword">if</span> (and (functionp 'network-interface-list)
           (network-interface-list))
      (some (<span class="org-keyword">lambda</span> (iface) (<span class="org-keyword">unless</span> (equal <span class="org-string">"lo"</span> (car iface))
                         (member 'up (first (last (network-interface-info
                                                   (car iface)))))))
            (network-interface-list))
    t))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">ELPA</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">Defining ELPA sources</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq package-archives
      '((<span class="org-string">"gnu"</span>         . <span class="org-string">"http://elpa.gnu.org/packages/"</span>)
        (<span class="org-string">"original"</span>    . <span class="org-string">"http://tromey.com/elpa/"</span>)
        (<span class="org-string">"org"</span>         . <span class="org-string">"http://orgmode.org/elpa/"</span>)
        (<span class="org-string">"marmalade"</span>   . <span class="org-string">"http://marmalade-repo.org/packages/"</span>)
        (<span class="org-string">"melpa"</span>       . <span class="org-string">"http://melpa.milkbox.net/packages/"</span>)))
(package-initialize)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2">Default packages</h4>
<div class="outline-text-4" id="text-1-2-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">defvar</span> <span class="org-variable-name">starter-kit-packages</span>
  (list 'yasnippet-bundle
        'magit
        'smex
        'solarized-theme
        'markdown-mode
        'highlight-parentheses
        'idle-highlight-mode
        'auto-complete
        'cmake-mode
        'org-bullets
        'ido-ubiquitous
        'dired-details
        'powerline
        'rainbow-mode
        'diminish
        'wrap-region
        'multi-term
        'multi-web-mode
        'go-mode
        'gnuplot
        'undo-tree
        'fill-column-indicator
        'xml-rpc
        'ack-and-a-half
        'smartparens
        'htmlize
        'flx
        'git-gutter-fringe+)
  <span class="org-doc">"Libraries that should be installed by default."</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3">Install defun</h4>
<div class="outline-text-4" id="text-1-2-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">starter-kit-elpa-install</span> ()
  <span class="org-doc">"Install all starter-kit packages that aren't installed."</span>
  (interactive)
  (<span class="org-keyword">dolist</span> (package starter-kit-packages)
    (<span class="org-keyword">unless</span> (package-installed-p package)
      (message <span class="org-string">"Installing %s"</span> (symbol-name package))
      (package-install package))))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4">Installing ELPA package</h4>
<div class="outline-text-4" id="text-1-2-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">when</span> (starter-kit-elpa-online)
  (<span class="org-keyword">unless</span> package-archive-contents (package-refresh-contents))
  (starter-kit-elpa-install))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">el-get</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<a href="https://github.com/dimitri/el-get"><code>el-get</code></a> allows you to install and manage elisp code for Emacs. It supports lots
of differents types of sources and is able to install them, update them and
remove them, but more importantly it will init them for you. The next pieces of
code are largely inspired by <a href="http://toumorokoshi.github.com/automatic-package-installation-for-emacs-24-part-2.html">this article</a>.
</p>
</div>

<div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1">Checking <code>el-get</code></h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'load-path <span class="org-string">"~/.emacs.d/el-get/el-get"</span>)
(<span class="org-keyword">unless</span> (<span class="org-keyword">require</span> '<span class="org-constant">el-get</span> nil t)
  (url-retrieve
   <span class="org-string">"https://raw.github.com/dimitri/el-get/master/el-get-install.el"</span>
   (<span class="org-keyword">lambda</span> (s)
     (goto-char (point-max))
     (eval-print-last-sexp))))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2">Setup packages</h4>
<div class="outline-text-4" id="text-1-3-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq el-get-sources
     '((<span class="org-builtin">:name</span> trac-wiki
        <span class="org-builtin">:description</span> <span class="org-string">"Simple but efficient interface to Trac."</span>
        <span class="org-builtin">:type</span> github
        <span class="org-builtin">:pkgname</span> <span class="org-string">"tiborsimko/trac-wiki-el"</span>)
       (<span class="org-builtin">:name</span> emacs-deferred
        <span class="org-builtin">:description</span> <span class="org-string">"Facilities to manage asynchronous tasks."</span>
        <span class="org-builtin">:type</span> github
        <span class="org-builtin">:pkgname</span> <span class="org-string">"kiwanami/emacs-deferred"</span>)
       (<span class="org-builtin">:name</span> inertial-scroll
        <span class="org-builtin">:description</span> <span class="org-string">"Soft mouse scrolling."</span>
        <span class="org-builtin">:type</span> github
        <span class="org-builtin">:pkgname</span> <span class="org-string">"kiwanami/emacs-inertial-scroll"</span>)
       )
     )
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3">Install packages</h4>
<div class="outline-text-4" id="text-1-3-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(mapc (<span class="org-keyword">lambda</span> (f)
        (<span class="org-keyword">let</span> ((name (plist-get f <span class="org-builtin">:name</span>)))
          (<span class="org-keyword">when</span> (not (<span class="org-keyword">require</span> <span class="org-constant">name</span> nil t)) (el-get-install name)))) el-get-sources)
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
File under git version control - commit f3e9d58 - 2013-11-25
</div>
</body>
</html>
